{
	"0": {
		"narration": "Welcome to the test chamber disguised as a cozy bedroom. Please click around to test if interactibles are working (but preferably clicking at doors first).",
		"branchText": "I go back to bedroom",
		"bg": "bedroom",
		"branches": [],
		"interactibles": {
			"1": {
				"type": "item",
				"description": "This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. This is lamp. ",
				"img":"lamp",
				"x1y1": [387,315],
				"x2y2": [440,390]
			},
			"2": {
				"type": "item",
				"description": "This is a chair.",
				"img":"chair",
				"collectible":true,
				"x1y1": [545,425],
				"x2y2": [665,505]
			},
			"3": {
				"type": "item",
				"description": "This is a picture showing you and your favourite wife from the old times, when you weren't trapped in a test chamber disguised as a cozy bedroom yet.",
				"img":"picture",
				"x1y1": [790,260],
				"x2y2": [918,350]
			},
			"4": {
				"type": "branch",
				"description": "These doors might look like they are open, but for the sake of science let's pretend they aren't and that you need to break them open with a chair.",
				"requires":2,
				"x1y1": [618,237],
				"x2y2": [707,420],
				"branches":1
			}
		},
		"death": false
	},
	"1": {
		"narration": "In the next room there is a man busy with vacuuming. This is your testing dummy to test if dialogues are working. Please talk to the dummy.",
		"branchText": "Leave bedroom",
		"bg": "vacuumanim",
		"animation":{
			"frams":8,
			"speed":0.5,
			"loop":5
		},
		"branches": [2,3,4],
		"death": false
	},
	"2": {
		"narration": "Testing dummy peaks at you, unamused. 'Excuse me Sir, I do not recognize the command' he responds.",
		"branchText": "'Hello cutie =^.^='",
		"bg": "vacuum",
		"branches": [0,4],
		"death": false
	},
	"3": {
		"narration": "Testing dummy seems completely unmoved by your brave declaration. 'In the current world, aren't we all slaves anyway?' he responds.",
		"branchText": "'Kneel peasant, from now on you shall be my slave'",
		"bg": "vacuum",
		"branches": [5],
		"death": false
	},
	"4": {
		"narration": "Apparently there was a huge chasm right behind the door in which you fall and die. Gee, what were the chances?",
		"branchText": "I can't stand human interaction like a shutin I am and leave the room hastily",
		"bg": "cliff",
		"branches": [],
		"death": true
	},
	"5": {
		"narration": "Testing dummy turns out to be a hungry bear in disguise and devours you savagely.",
		"branchText": "I kick my new minion for being disobedient",
		"bg": "bear",
		"branches": [],
		"death": true
	}
}